{
  "version": 2,
  "tones": ["safe", "spicy"],
  "defaults": {
    "category": "general",
    "tone": "safe",
    "maxBatch": 50
  },
  "categories": {
    "general": {
      "safe": [
        "Task failed successfully.",
        "We asked the server nicely. It said “no.”",
        "A rare edge case appeared and immediately fled the scene.",
        "Your request has been forwarded to /dev/null for processing.",
        "The gremlins have unionised. Please retry after negotiations.",
        "This operation currently cba.",
        "Everything is fine. (This is a lie.)",
        "It worked earlier. Reality has since been updated.",
        "Your request was accepted and then quietly regretted.",
        "The system is experiencing an acute case of “not today”.",
        "We replaced your success with a premium failure.",
        "A cosmic ray flipped the ‘yes’ bit to ‘no’.",
        "The hamster powering this service needs a tea break.",
        "This request has been escalated to the Department of Shrugging.",
        "We tried nothing and we’re all out of ideas.",
        "The magic smoke stayed in. The result did not.",
        "It’s not you. It’s our infrastructure.",
        "The request got lost along the way.",
        "Your success token has expired. Please acquire a new destiny.",
        "We found the bug. It found us first."
      ],
      "spicy": [
        "Well… that went sideways at speed.",
        "Your request got punted into the void. Efficiently.",
        "The server considered it, sighed, and chose chaos.",
        "Success was briefly available, then patched out.",
        "That’s a bold request. The system responded: ‘absolutely not’.",
        "We put it in the queue. The queue is on fire.",
        "Somewhere, a log just wrote “lol” and closed itself.",
        "The gremlins are back and they’ve brought snacks.",
        "Operation failed due to an acute shortage of fucks.",
        "We attempted a miracle. We got a shrug.",
        "This is working as intended (the intent is misery).",
        "Your request was processed into pure disappointment.",
        "The hamster tripped over a cable and filed a grievance.",
        "We tried turning it off and on. It turned into this.",
        "Reality disagreed with our assumptions. Rude.",
        "That error is new. Congrats on the discovery.",
        "We’ve escalated this to the Department of ‘Not Today’.",
        "The universe said “nah” and the server agreed.",
        "This request has been politely told to piss off.",
        "No. ❤️"
      ]
    },
    "business": {
      "safe": [
        "This is a known issue and has been added to the backlog.",
        "Blocked pending approval from the Approvals Approval Board.",
        "We’re aligning stakeholders before proceeding.",
        "Unable to complete due to competing priorities this sprint.",
        "We’ll circle back after we socialise the solution.",
        "Pending a cross-functional sync to unblock the unblockers.",
        "Action item created. Outcome pending.",
        "Please raise a ticket so we can raise another ticket.",
        "This requires a steering committee, a sub-committee, and a snack committee.",
        "We’re currently in discovery about why this worked yesterday.",
        "This is out of scope for the current scope.",
        "We’ve taken this offline for optimisation (emotionally).",
        "Our roadmap is very excited about this… in Q4.",
        "This will be resolved in the next iterative iteration.",
        "Can we take this to the parking lot? It’s crowded in here."
      ],
      "spicy": [
        "Added to the backlog, where good ideas go to die.",
        "Blocked pending approval from someone who’s ‘in meetings’ forever.",
        "We’ll circle back after the next alignment ritual.",
        "That’s a great suggestion. Unfortunately, it’s not happening.",
        "Please raise a ticket so we can create a dashboard about ignoring it.",
        "Action item logged. Ownership assigned to ‘later’.",
        "Out of scope for this sprint, the next sprint, and your lifetime.",
        "We need stakeholder buy-in and a small miracle.",
        "This requires a steering committee and a blood sacrifice to the roadmap.",
        "Pending review by the Committee of Vibes and Vetoes.",
        "We’ve scheduled a meeting to decide if we should schedule a meeting.",
        "Budget says no. Finance says hell no.",
        "We’ll address this in Q4. Which year? Don’t worry about it.",
        "Let’s park this. The car park is full of broken promises.",
        "Per my last email: no."
      ]
    },
    "devops": {
      "safe": [
        "It worked in staging. Production felt differently.",
        "Deploy succeeded. Reality did not.",
        "Kubernetes accepted your offering and remains unsatisfied.",
        "DNS is propagating. Somewhere. Probably.",
        "Autoscaling is functioning. Just not in your favour.",
        "The load balancer chose violence.",
        "A container has escaped. Please do not approach.",
        "We rotated the secrets. Now everything is a secret.",
        "The service is up. The dependencies are spiritually absent.",
        "Your request hit a node that’s doing its best.",
        "The cache is warm. The results are cold.",
        "Rollout in progress. Please stand by (in a safe location).",
        "We’re rate-limited by physics.",
        "The SLO is fine if you don’t look at it.",
        "The pager is screaming in lowercase."
      ],
      "spicy": [
        "Production is fine. It’s just actively falling apart.",
        "It was DNS. It’s always DNS. Even when it isn’t.",
        "Deploy completed. The fallout is still in progress.",
        "Kubernetes accepted your offering and demanded another goat.",
        "The load balancer has chosen violence and feels justified.",
        "Your request landed on the one node held together by hope and tape.",
        "We scaled up. The problem scaled faster.",
        "The cache is warm, the data is cursed.",
        "We rotated secrets and now nothing knows who it is.",
        "CI passed. CD did a backflip into a bin.",
        "Rollback initiated. Pray for us.",
        "Incident declared. Snack supply is critical.",
        "Latency is up because the internet is having a bad day.",
        "The SLO is green because we stopped measuring the red bits.",
        "On-call has entered the chat (unhappily)."
      ]
    },
    "security": {
      "safe": [
        "Request denied by policy: ‘nope’.",
        "Your token is valid, but the vibes are not.",
        "Access denied. Please authenticate as someone more important.",
        "Threat model says no. Threat model always says no.",
        "MFA succeeded. Authorisation did not.",
        "Your request triggered the ‘suspiciously optimistic’ detector.",
        "Blocked by WAF: ‘pretty sus’.",
        "Least privilege engaged. You have the least of everything.",
        "We quarantined the outcome for its own safety.",
        "Zero Trust: we don’t trust this request, either.",
        "Your session expired while thinking about it.",
        "The audit log is writing this down with disappointment.",
        "Denied: you tried to do a thing.",
        "Policy engine returned: ‘nah’.",
        "Encrypted. But at what cost?"
      ],
      "spicy": [
        "Denied by policy: we don’t do fun here.",
        "Your token is valid, your authorisation is not. Awkward.",
        "Access denied. Please authenticate as someone more powerful.",
        "Zero Trust means zero trust. Yes, including you.",
        "Least privilege engaged: you get the least of everything.",
        "MFA succeeded. Authorisation said “cute” and refused.",
        "Blocked by WAF: the vibes were suspicious.",
        "Threat model says no. Threat model always wins.",
        "Your request tripped the ‘suspiciously confident’ detector.",
        "Quarantined for its own protection (and ours).",
        "This action would create an audit log, and we’re not ready for that.",
        "Session expired while you were thinking optimistic thoughts.",
        "Denied: attempted to do a thing.",
        "Policy engine returned: ‘nah fam’.",
        "Approved. Just kidding. Denied."
      ]
    },
    "product": {
      "safe": [
        "Feature not available in your timeline.",
        "This button is decorative in the MVP.",
        "We shipped it to production and then remembered QA exists.",
        "The UX is guiding you to acceptance.",
        "The roadmap says yes. The implementation says maybe.",
        "This flow is currently A/B testing sadness.",
        "The toggle toggled. Nothing else did.",
        "We’re measuring user delight. This did not help.",
        "This is a premium feature (of failure).",
        "We’ve deprecated success in favour of learnings.",
        "Your request was converted into an insight.",
        "This is working as designed (unfortunately).",
        "You’ve discovered an undocumented experience.",
        "This is the intended workaround: give up.",
        "We’ll fix it after we finish fixing the fixer."
      ],
      "spicy": [
        "Feature not available because we haven’t built it. Yet. Maybe. No.",
        "This button is decorative. Like our timelines.",
        "Shipped to production, QA found out via Twitter.",
        "Roadmap says yes. Reality says ‘lol’.",
        "We’re A/B testing sadness and you’re in group B (for Bad).",
        "The toggle toggled. The feature did nothing. Iconic.",
        "We turned it into an insight and filed it under ‘later’.",
        "This is working as designed (the design is questionable).",
        "You’ve discovered an undocumented experience. Congrats / sorry.",
        "That flow is currently optimised for disappointment.",
        "This is a premium feature: premium failure included.",
        "Expected behaviour. Unhelpful behaviour, but expected.",
        "We’ll fix it after we finish fixing the fixer that fixes the fixes.",
        "Workaround: pretend you didn’t see this.",
        "User delight has left the building."
      ]
    }
  }
}
